#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-pos-tech/customer-service/runs/run-8gqB1kFdtx9aH7GH

Waiting for the plan to start...

Terraform v1.7.1
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.main: Refreshing...
data.aws_security_group.vpc_endpoint_sm_cl: Refreshing...
aws_iam_role.service_execution_role: Refreshing state... [id=customer_service_service_execution_role]
aws_secretsmanager_secret.database_credential: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/Database/Credential-kDSaYb]
data.aws_ecs_cluster.cluster: Refreshing...
data.aws_secretsmanager_secret.database_admin_secret: Refreshing...
aws_secretsmanager_secret.aes_password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/Password-LF2vle]
data.aws_apigatewayv2_api.tech_challenge_api: Refreshing...
aws_sns_topic.customer_data_removal_topic: Refreshing state... [id=arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic]
aws_secretsmanager_secret.app_database_password_secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Service/Customer/Password-kDSaYb]
data.aws_ecs_cluster.cluster: Refresh complete after 0s [id=arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge]
data.aws_secretsmanager_secret.database_admin_secret: Refresh complete after 0s [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Admin/Password-EvvaCX]
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refreshing...
aws_sqs_queue.removed_customer_data_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/598135944514/prd-customer-remove-data-response-queue-dlq]
aws_cloudwatch_log_group.service_log_group: Refreshing state... [id=/ecs/customer-service]
aws_secretsmanager_secret.aes_algorithm: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/Algorithm-XDZJSd]
aws_secretsmanager_secret.aes_iv: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/IV-kDSaYb]
aws_s3_bucket.customer_data_removal_bucket: Refreshing state... [id=customer-data-removal]
aws_sqs_queue.remove_customer_data_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue-dlq]
aws_secretsmanager_secret_version.app_database_password_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Service/Customer/Password-kDSaYb|terraform-20240310195137300300000009]
data.aws_secretsmanager_secret_version.database_admin_secret_version: Refreshing...
data.aws_apigatewayv2_api.tech_challenge_api: Refresh complete after 0s [id=5am5sutwt1]
aws_secretsmanager_secret_version.aes_password_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/Password-LF2vle|terraform-20240310195137208300000006]
aws_secretsmanager_secret_version.aes_algorithm_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/Algorithm-XDZJSd|terraform-20240310195137220600000007]
aws_secretsmanager_secret_version.aes_iv_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/IV-kDSaYb|terraform-20240310195137225600000008]
aws_sqs_queue.removed_customer_data_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/598135944514/prd-customer-remove-data-response-queue]
data.aws_secretsmanager_secret_version.database_admin_secret_version: Refresh complete after 0s [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Admin/Password-EvvaCX|AWSCURRENT]
aws_sqs_queue.remove_customer_data_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue]
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refresh complete after 0s [id=9sezcf]
aws_sqs_queue_policy.customer_event_to_process_subscription: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue]
aws_sns_topic_subscription.get_customer_remove_events: Refreshing state... [id=arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic:3a96bc89-dc35-4672-97b5-6b07f7a130a3]
data.aws_security_group.vpc_endpoint_sm_cl: Refresh complete after 1s [id=sg-0e2dc7c7e10243507]
aws_s3_bucket_versioning.customer_data_removal_versioning: Refreshing state... [id=customer-data-removal]
aws_iam_role_policy.service_execution_policy: Refreshing state... [id=customer_service_service_execution_role:customer_service_service_execution_policy]
aws_s3_bucket_ownership_controls.customer_data_removal_ownership_controls: Refreshing state... [id=customer-data-removal]
aws_s3_bucket_public_access_block.customer_data_removal_public_access_block: Refreshing state... [id=customer-data-removal]
aws_s3_bucket_acl.customer_data_removal_bucket_acl: Refreshing state... [id=customer-data-removal,public-read]
data.aws_vpc.main: Refresh complete after 1s [id=vpc-0c5a69114563ca731]
data.aws_subnets.private_subnet_ids: Refreshing...
aws_security_group.alb_sg: Refreshing state... [id=sg-01d86bc5a96fdbe2f]
data.aws_subnets.database_subnet_ids: Refreshing...
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:598135944514:targetgroup/customer-service-tg/f69d41b478b1bcab]
aws_security_group.service_sg: Refreshing state... [id=sg-0a758cdf2d4eacdf6]
data.aws_subnets.private_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refreshing...
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refreshing...
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refreshing...
data.aws_subnets.database_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refreshing...
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refreshing...
aws_security_group_rule.ecs_to_vpc_endpoints: Refreshing state... [id=sgrule-1693206747]
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refresh complete after 0s [id=subnet-0f6198953ee43af96]
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refresh complete after 0s [id=subnet-04fba355f9c419a79]
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refresh complete after 0s [id=subnet-0fe0ac5ee5dfc62a8]
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refresh complete after 0s [id=subnet-00f22e8c798c2dc4f]
aws_db_subnet_group.tech_challenge_rds_subnet_group: Refreshing state... [id=customer-service-rds-subnet-group]
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refresh complete after 0s [id=subnet-03ac578c469316b7b]
aws_security_group.rds_sg: Refreshing state... [id=sg-0e296747e0f4dfd9d]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:598135944514:loadbalancer/app/customer-service-alb/70ced61ac92523b9]
aws_lb_listener.listener_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:598135944514:listener/app/customer-service-alb/70ced61ac92523b9/dfdd744b98934ffd]
aws_db_instance.tech_challenge_db: Refreshing state... [id=db-4DCI6KPSKQJJNPNBAAFYP3XKA4]
aws_apigatewayv2_integration.apigw_integration: Refreshing state... [id=ork1zr3]
aws_apigatewayv2_route.apigw_route_to_root: Refreshing state... [id=0koaho3]
aws_apigatewayv2_route.apigw_route_to_all_internal: Refreshing state... [id=xvn1rg3]
aws_ecs_task_definition.task_definition: Refreshing state... [id=tsk-customer-service]
mysql_database.service_database: Refreshing state... [id=customer]
mysql_user.service_user: Refreshing state... [id=sys_customer@%]
aws_secretsmanager_secret_version.signer_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/Database/Credential-kDSaYb|terraform-2024031019554806130000000a]
mysql_grant.service_user_grant: Refreshing state... [id=sys_customer@%:`customer`]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:598135944514:service/tech-challenge/customer-service]
aws_s3_bucket.customer_data_removal_bucket: Drift detected (update)
aws_sqs_queue.remove_customer_data_queue: Drift detected (update)
aws_lb_listener.listener_http: Drift detected (update)
aws_sqs_queue.removed_customer_data_queue: Drift detected (update)
aws_secretsmanager_secret.aes_algorithm: Drift detected (update)
aws_sns_topic.customer_data_removal_topic: Drift detected (update)
aws_ecs_service.service: Drift detected (update)
aws_secretsmanager_secret.aes_iv: Drift detected (update)
aws_secretsmanager_secret.app_database_password_secret: Drift detected (update)
aws_apigatewayv2_route.apigw_route_to_root: Drift detected (update)
aws_lb_target_group.target_group: Drift detected (update)
aws_secretsmanager_secret.database_credential: Drift detected (update)
aws_ecs_task_definition.task_definition: Drift detected (update)
aws_sqs_queue.removed_customer_data_dlq: Drift detected (update)
aws_db_instance.tech_challenge_db: Drift detected (update)
aws_sqs_queue.remove_customer_data_dlq: Drift detected (update)
aws_iam_role.service_execution_role: Drift detected (update)
aws_secretsmanager_secret_version.app_database_password_version: Drift detected (update)
aws_secretsmanager_secret.aes_password: Drift detected (update)
aws_security_group.rds_sg: Drift detected (update)
aws_apigatewayv2_route.apigw_route_to_all_internal: Drift detected (update)
aws_apigatewayv2_integration.apigw_integration: Drift detected (update)
aws_security_group_rule.ecs_to_vpc_endpoints: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-8gqB1kFdtx9aH7GH/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-8gqB1kFdtx9aH7GH/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.service_execution_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "service_execution_policy" {
        id     = "customer_service_service_execution_role:customer_service_service_execution_policy"
        name   = "customer_service_service_execution_policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "01"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Service/Customer/Password-kDSaYb",
                          - "arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/Algorithm-XDZJSd",
                          - "arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/Password-LF2vle",
                          - "arn:aws:secretsmanager:us-east-1:598135944514:secret:service/Customer/AES/IV-kDSaYb",
                        ]
                      - Sid      = "02"
                    },
                  - {
                      - Action   = [
                          - "sns:Publish",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic",
                        ]
                      - Sid      = "03"
                    },
                  - {
                      - Action   = [
                          - "sns:ListTopics",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "04"
                    },
                  - {
                      - Action   = [
                          - "sqs:GetQueueUrl",
                          - "sqs:SendMessageBatch",
                          - "sqs:ReceiveMessage",
                          - "sqs:SendMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue",
                          - "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue-dlq",
                          - "arn:aws:sqs:us-east-1:598135944514:prd-customer-remove-data-response-queue",
                          - "arn:aws:sqs:us-east-1:598135944514:prd-customer-remove-data-response-queue-dlq",
                        ]
                      - Sid      = "05"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::customer-data-removal",
                        ]
                      - Sid      = "06"
                    },
                  - {
                      - Action   = [
                          - "s3:*Object",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::customer-data-removal/*",
                        ]
                      - Sid      = "07"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_sns_topic_subscription.get_customer_remove_events must be replaced
-/+ resource "aws_sns_topic_subscription" "get_customer_remove_events" {
      ~ arn                             = "arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic:3a96bc89-dc35-4672-97b5-6b07f7a130a3" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic:3a96bc89-dc35-4672-97b5-6b07f7a130a3" -> (known after apply)
      ~ owner_id                        = "598135944514" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sqs_queue.remove_customer_data_dlq must be replaced
-/+ resource "aws_sqs_queue" "remove_customer_data_dlq" {
      ~ arn                               = "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue-dlq" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue-dlq" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "prd-purchase-remove-customer-data-queue-dlq" -> "prd-customer-remove-customer-data-queue-dlq" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue-dlq" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_sqs_queue.remove_customer_data_queue must be replaced
-/+ resource "aws_sqs_queue" "remove_customer_data_queue" {
      ~ arn                               = "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "prd-purchase-remove-customer-data-queue" -> "prd-customer-remove-customer-data-queue" # forces replacement
      + name_prefix                       = (known after apply)
      ~ policy                            = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ redrive_allow_policy              = jsonencode(
            {
              - redrivePermission = "byQueue"
              - sourceQueueArns   = [
                  - "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue-dlq",
                ]
            }
        ) -> (known after apply)
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue-dlq"
              - maxReceiveCount     = 3
            }
        ) -> (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.customer_event_to_process_subscription must be replaced
-/+ resource "aws_sqs_queue_policy" "customer_event_to_process_subscription" {
      ~ id        = "https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue" -> (known after apply)
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sqs:SendMessage",
                        ]
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:598135944514:prd-customer-remove-data-topic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:sqs:us-east-1:598135944514:prd-purchase-remove-customer-data-queue",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ queue_url = "https://sqs.us-east-1.amazonaws.com/598135944514/prd-purchase-remove-customer-data-queue" # forces replacement -> (known after apply) # forces replacement
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @eberson, Action: `pull_request`*